AlmAck/svdtonuttx/demo/h/da1470_charger.h
/****************************************************************************
 * ./tmp/da1470_charger.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_CHARGER_H
#define __DA1470_CHARGER_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470_CHARGER_CHARGER_CC_CHARGE_TIMER_OFFSET     0x0028 /* Maximum CC-charge time limit register */
#define DA1470_CHARGER_CHARGER_CTRL_OFFSET                0x0000 /* Charger main control register */
#define DA1470_CHARGER_CHARGER_CURRENT_PARAM_OFFSET       0x0010 /* Charger current settings register */
#define DA1470_CHARGER_CHARGER_CURRENT_STATUS_OFFSET      0x0018 /* Charger current status register */
#define DA1470_CHARGER_CHARGER_CV_CHARGE_TIMER_OFFSET     0x002C /* Maximum CV-charge time limit register */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_CLR_OFFSET       0x007C /* Interrupt clear register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_MASK_OFFSET      0x006C /* Mask register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_STATUS_OFFSET    0x0074 /* Status register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_JEITA_CURRENT2_OFFSET      0x0048 /* JEITA-compliant current settings register for "Cooler" and "Warmer" zones */
#define DA1470_CHARGER_CHARGER_JEITA_CURRENT_OFFSET       0x0044 /* JEITA-compliant current settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_CHARGE_OFFSET      0x0034 /* JEITA-compliant Charge voltage settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_OVP_OFFSET         0x0040 /* JEITA-compliant OVP settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_PRECHARGE_OFFSET   0x0038 /* JEITA-compliant Pre-Charge voltage settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_REPLENISH_OFFSET   0x003C /* JEITA-compliant Replenish settings register */
#define DA1470_CHARGER_CHARGER_LOCK_OFFSET                0x0080 /* Charger HW lock register */
#define DA1470_CHARGER_CHARGER_PRE_CHARGE_TIMER_OFFSET    0x0024 /* Maximum pre-charge time limit register */
#define DA1470_CHARGER_CHARGER_PWR_UP_TIMER_OFFSET        0x0064 /* Charger power-up settling timer register */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_CLR_OFFSET       0x0078 /* Interrupt clear register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_MASK_OFFSET      0x0068 /* Mask register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_STATUS_OFFSET    0x0070 /* Status register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATUS_OFFSET              0x0008 /* Charger main status register */
#define DA1470_CHARGER_CHARGER_SWLOCK_OFFSET              0x0084 /* Charger SW lock register */
#define DA1470_CHARGER_CHARGER_TBAT_COMP_TIMER_OFFSET     0x005C /* Battery temperature (main) comparator timer register */
#define DA1470_CHARGER_CHARGER_TBAT_MON_TIMER_OFFSET      0x0058 /* Battery temperature monitor interval timer register */
#define DA1470_CHARGER_CHARGER_TDIE_COMP_TIMER_OFFSET     0x0054 /* Die temperature comparator timer register */
#define DA1470_CHARGER_CHARGER_TEMPSET2_PARAM_OFFSET      0x0020 /* Charger battery temperature settings register (Cooler, Warmer). */
#define DA1470_CHARGER_CHARGER_TEMPSET_PARAM_OFFSET       0x001C /* Charger battery temperature settings register */
#define DA1470_CHARGER_CHARGER_THOT_COMP_TIMER_OFFSET     0x0060 /* Battery temperature comparator timer register for "Hot" zone */
#define DA1470_CHARGER_CHARGER_TOTAL_CHARGE_TIMER_OFFSET  0x0030 /* Maximum total charge time limit register */
#define DA1470_CHARGER_CHARGER_VBAT_COMP_TIMER_OFFSET     0x004C /* Main Vbat comparator timer register */
#define DA1470_CHARGER_CHARGER_VOLTAGE_PARAM_OFFSET       0x000C /* Charger voltage settings register */
#define DA1470_CHARGER_CHARGER_VOLTAGE_STATUS_OFFSET      0x0014 /* Charger voltage status register */
#define DA1470_CHARGER_CHARGER_VOVP_COMP_TIMER_OFFSET     0x0050 /* Vbat OVP comparator timer register */

/* Register addresses *******************************************************/

#define DA1470_CHARGER_BASE                               0x51000600 /* CHARGER registers */

#define DA1470_CHARGER_CHARGER_CC_CHARGE_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_CC_CHARGE_TIMER_OFFSET) /* Maximum CC-charge time limit register */
#define DA1470_CHARGER_CHARGER_CTRL                       (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_CTRL_OFFSET) /* Charger main control register */
#define DA1470_CHARGER_CHARGER_CURRENT_PARAM              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_CURRENT_PARAM_OFFSET) /* Charger current settings register */
#define DA1470_CHARGER_CHARGER_CURRENT_STATUS             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_CURRENT_STATUS_OFFSET) /* Charger current status register */
#define DA1470_CHARGER_CHARGER_CV_CHARGE_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_CV_CHARGE_TIMER_OFFSET) /* Maximum CV-charge time limit register */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_CLR              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_ERROR_IRQ_CLR_OFFSET) /* Interrupt clear register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_MASK             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_ERROR_IRQ_MASK_OFFSET) /* Mask register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_ERROR_IRQ_STATUS           (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_ERROR_IRQ_STATUS_OFFSET) /* Status register of Charger Error IRQs */
#define DA1470_CHARGER_CHARGER_JEITA_CURRENT2             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_CURRENT2_OFFSET) /* JEITA-compliant current settings register for "Cooler" and "Warmer" zones */
#define DA1470_CHARGER_CHARGER_JEITA_CURRENT              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_CURRENT_OFFSET) /* JEITA-compliant current settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_CHARGE             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_V_CHARGE_OFFSET) /* JEITA-compliant Charge voltage settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_OVP                (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_V_OVP_OFFSET) /* JEITA-compliant OVP settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_PRECHARGE          (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_V_PRECHARGE_OFFSET) /* JEITA-compliant Pre-Charge voltage settings register */
#define DA1470_CHARGER_CHARGER_JEITA_V_REPLENISH          (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_JEITA_V_REPLENISH_OFFSET) /* JEITA-compliant Replenish settings register */
#define DA1470_CHARGER_CHARGER_LOCK                       (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_LOCK_OFFSET) /* Charger HW lock register */
#define DA1470_CHARGER_CHARGER_PRE_CHARGE_TIMER           (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_PRE_CHARGE_TIMER_OFFSET) /* Maximum pre-charge time limit register */
#define DA1470_CHARGER_CHARGER_PWR_UP_TIMER               (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_PWR_UP_TIMER_OFFSET) /* Charger power-up settling timer register */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_CLR              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_STATE_IRQ_CLR_OFFSET) /* Interrupt clear register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_MASK             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_STATE_IRQ_MASK_OFFSET) /* Mask register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATE_IRQ_STATUS           (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_STATE_IRQ_STATUS_OFFSET) /* Status register of Charger FSM IRQs */
#define DA1470_CHARGER_CHARGER_STATUS                     (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_STATUS_OFFSET) /* Charger main status register */
#define DA1470_CHARGER_CHARGER_SWLOCK                     (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_SWLOCK_OFFSET) /* Charger SW lock register */
#define DA1470_CHARGER_CHARGER_TBAT_COMP_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TBAT_COMP_TIMER_OFFSET) /* Battery temperature (main) comparator timer register */
#define DA1470_CHARGER_CHARGER_TBAT_MON_TIMER             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TBAT_MON_TIMER_OFFSET) /* Battery temperature monitor interval timer register */
#define DA1470_CHARGER_CHARGER_TDIE_COMP_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TDIE_COMP_TIMER_OFFSET) /* Die temperature comparator timer register */
#define DA1470_CHARGER_CHARGER_TEMPSET2_PARAM             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TEMPSET2_PARAM_OFFSET) /* Charger battery temperature settings register (Cooler, Warmer). */
#define DA1470_CHARGER_CHARGER_TEMPSET_PARAM              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TEMPSET_PARAM_OFFSET) /* Charger battery temperature settings register */
#define DA1470_CHARGER_CHARGER_THOT_COMP_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_THOT_COMP_TIMER_OFFSET) /* Battery temperature comparator timer register for "Hot" zone */
#define DA1470_CHARGER_CHARGER_TOTAL_CHARGE_TIMER         (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_TOTAL_CHARGE_TIMER_OFFSET) /* Maximum total charge time limit register */
#define DA1470_CHARGER_CHARGER_VBAT_COMP_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_VBAT_COMP_TIMER_OFFSET) /* Main Vbat comparator timer register */
#define DA1470_CHARGER_CHARGER_VOLTAGE_PARAM              (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_VOLTAGE_PARAM_OFFSET) /* Charger voltage settings register */
#define DA1470_CHARGER_CHARGER_VOLTAGE_STATUS             (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_VOLTAGE_STATUS_OFFSET) /* Charger voltage status register */
#define DA1470_CHARGER_CHARGER_VOVP_COMP_TIMER            (DA1470_CHARGER_BASE + DA1470_CHARGER_CHARGER_VOVP_COMP_TIMER_OFFSET) /* Vbat OVP comparator timer register */

/* Register bit definitions *************************************************/


