AlmAck/svdtonuttx/demo/h/da1470_charger.h
/* CHARGER_CC_CHARGE_TIMER Register */

#define CC_CHARGE_TIMER_MASK                              (0x7FFF << 16) /* Returns the current value of the CC-Charge timeout counter, running at a 1Hz clo */
#define CC_CHARGE_TIMER_POS                               (16) /* Returns the current value of the CC-Charge timeout counter, running at a 1Hz clo */
#define MAX_CC_CHARGE_TIME_MASK                           (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define MAX_CC_CHARGE_TIME_POS                            (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_CTRL Register */

#define EOC_TRIGGER                                       (1U << 28) /* 0 = Edge-sensitive End-of-Charge detection support is enabled (default). The Cha */
#define EOC_INTERVAL_CHECK_TIMER_MASK                     (0x3F << 22) /* The specific bit-field determines the current state of the timer used to periodi */
#define EOC_INTERVAL_CHECK_TIMER_POS                      (22) /* The specific bit-field determines the current state of the timer used to periodi */
#define EOC_INTERVAL_CHECK_THRES_MASK                     (0x3F << 16) /* This bit-field determines the periodic interval of checking the End-of-Charge si */
#define EOC_INTERVAL_CHECK_THRES_POS                      (16) /* This bit-field determines the periodic interval of checking the End-of-Charge si */
#define REPLENISH_MODE                                    (1U << 15) /* When this bit-field is set and the Charger's FSM is in the BYPASSED state (thus, */
#define PRE_CHARGE_MODE                                   (1U << 14) /* When set, this bit-field enables a signal of the same name with the bit-field, d */
#define CHARGE_LOOP_HOLD                                  (1U << 13) /* When set, this bit-field disables charging, provided that the Charger's FSM has  */
#define JEITA_SUPPORT_DISABLED                            (1U << 12) /* 0 = Charger's JEITA FSM monitoring the battery temperature checks also if batter */
#define TBAT_MONITOR_MODE_MASK                            (0x3 << 10) /* Battery temperature pack monitoring modes, according to the following encoding:  */
#define TBAT_MONITOR_MODE_POS                             (10) /* Battery temperature pack monitoring modes, according to the following encoding:  */
#define CHARGE_TIMERS_HALT_ENABLE                         (1U << 9) /* 0 = Charge timeout timers continue running when charging is disabled because of  */
#define STOP_CHARGE_TIMERS                                (1U << 8) /* 0 = Charger's Pre-Charge, CC, CV and Total charge timeout timers are ticking pro */
#define NTC_LOW_DISABLE                                   (1U << 7) /* 0 = Charging is disabled when the battery temperature is found to have reached t */
#define TBAT_PROT_ENABLE                                  (1U << 6) /* 0 = Battery temperature protection disabled 1 = Battery temperature protection e */
#define TDIE_ERROR_RESUME                                 (1U << 5) /* 0 = FSM will not resume from a Die temperature error. Consequently, its state wi */
#define TDIE_PROT_ENABLE                                  (1U << 4) /* 0 = Die temperature protection is disabled, thus charging will not be disabled b */
#define CHARGER_RESUME                                    (1U << 3) /* 0 = Charger's FSM is not enable to resume from a charge timeout error or a Vbat  */
#define CHARGER_BYPASS                                    (1U << 2) /* 0 = Charger's FSM is active and running, notifying SW upon switching between its */
#define CHARGE_START                                      (1U << 1) /* 0 = Charger's FSM is disabled, FSM stays at "DISABLED" state 1 = Charger's FSM i */
#define CHARGER_ENABLE                                    (1U << 0) /* 0 = Charger's analogue circuitry is powered-down 1 = Charger's analogue circuitr */

/* CHARGER_CURRENT_PARAM Register */

#define I_EOC_DOUBLE_RANGE                                (1U << 15) /* When set, the specific bit-field enables an increase of the (%) range of End-of- */
#define I_END_OF_CHARGE_MASK                              (0x7 << 12) /* End-of-Charge current setting, ranging from 6%("000") to 20% ("111") of the char */
#define I_END_OF_CHARGE_POS                               (12) /* End-of-Charge current setting, ranging from 6%("000") to 20% ("111") of the char */
#define I_PRECHARGE_MASK                                  (0x3F << 6) /* This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 72m */
#define I_PRECHARGE_POS                                   (6) /* This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 72m */
#define I_CHARGE_MASK                                     (0x3F << 0) /* This bit-field determines the charge current range, in mA. The range is from 5mA */
#define I_CHARGE_POS                                      (0) /* This bit-field determines the charge current range, in mA. The range is from 5mA */

/* CHARGER_CURRENT_STATUS Register */

#define I_PRECHARGE_SET_MASK                              (0x3F << 6) /* This bit-field returns the applied Pre-Charge current setting. In JEITA charging */
#define I_PRECHARGE_SET_POS                               (6) /* This bit-field returns the applied Pre-Charge current setting. In JEITA charging */
#define I_CHARGE_SET_MASK                                 (0x3F << 0) /* This bit-field returns the applied CC current setting. In JEITA charging, it con */
#define I_CHARGE_SET_POS                                  (0) /* This bit-field returns the applied CC current setting. In JEITA charging, it con */

/* CHARGER_CV_CHARGE_TIMER Register */

#define CV_CHARGE_TIMER_MASK                              (0x7FFF << 16) /* Returns the current value of the CV-Charge timeout counter, running at a 1Hz clo */
#define CV_CHARGE_TIMER_POS                               (16) /* Returns the current value of the CV-Charge timeout counter, running at a 1Hz clo */
#define MAX_CV_CHARGE_TIME_MASK                           (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define MAX_CV_CHARGE_TIME_POS                            (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_ERROR_IRQ_CLR Register */

#define TBAT_ERROR_IRQ_CLR                                (1U << 6) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define TDIE_ERROR_IRQ_CLR                                (1U << 5) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define VBAT_OVP_ERROR_IRQ_CLR                            (1U << 4) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define TOTAL_CHARGE_TIMEOUT_IRQ_CLR                      (1U << 3) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CV_CHARGE_TIMEOUT_IRQ_CLR                         (1U << 2) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define CC_CHARGE_TIMEOUT_IRQ_CLR                         (1U << 1) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */
#define PRECHARGE_TIMEOUT_IRQ_CLR                         (1U << 0) /* Writing a 1 will reset the respective Charger's Error IRQ status bit ; writing a */

/* CHARGER_ERROR_IRQ_MASK Register */

