AlmAck/svdtonuttx/demo/h/da1470_charger.h
#define TBAT_ERROR_IRQ_EN                                 (1U << 6) /* When set, it enables the generation of Battery temperature IRQs.The IRQ is gener */
#define TDIE_ERROR_IRQ_EN                                 (1U << 5) /* When set, it enables the generation of Die temperature error IRQs. The IRQ is ge */
#define VBAT_OVP_ERROR_IRQ_EN                             (1U << 4) /* When set, it enables the generation of VBAT_OVP IRQs. The IRQ is generated as so */
#define TOTAL_CHARGE_TIMEOUT_IRQ_EN                       (1U << 3) /* When set, it enables the total charge timeout IRQs. The IRQ is generated as soon */
#define CV_CHARGE_TIMEOUT_IRQ_EN                          (1U << 2) /* When set, it enables the CV charge timeout IRQs. The IRQ is generated as soon as */
#define CC_CHARGE_TIMEOUT_IRQ_EN                          (1U << 1) /* When set, it enables the CC charge timeout IRQs. The IRQ is generated as soon as */
#define PRECHARGE_TIMEOUT_IRQ_EN                          (1U << 0) /* When set, it enables the Pre-Charge timeout IRQs. The IRQ is generated as soon a */

/* CHARGER_ERROR_IRQ_STATUS Register */

#define TBAT_ERROR_IRQ                                    (1U << 6) /* 0 = No Battery temperature error IRQ event is captured, so charging may continue */
#define TDIE_ERROR_IRQ                                    (1U << 5) /* 0 = No Die temperature error IRQ events have been captured, so charging may cont */
#define VBAT_OVP_ERROR_IRQ                                (1U << 4) /* 0 = Vbat has not exceeded the Over-Voltage Protection (OVP) level, so charging m */
#define TOTAL_CHARGE_TIMEOUT_IRQ                          (1U << 3) /* 0 = Total charge time counter has not yet reached the maximum charge time (set i */
#define CV_CHARGE_TIMEOUT_IRQ                             (1U << 2) /* 0 = State charge time counter has not yet reached the maximum CV charge time (se */
#define CC_CHARGE_TIMEOUT_IRQ                             (1U << 1) /* 0 = State charge time counter has not yet reached the maximum CC charge time (se */
#define PRECHARGE_TIMEOUT_IRQ                             (1U << 0) /* 0 = State charge time counter has not yet reached the maximum Pre-charge time (s */

/* CHARGER_JEITA_CURRENT2 Register */

#define I_PRECHARGE_TWARMER_MASK                          (0x3F << 18) /* Pre-charge current settings bit-field for the "WARMER" battery temperature pack  */
#define I_PRECHARGE_TWARMER_POS                           (18) /* Pre-charge current settings bit-field for the "WARMER" battery temperature pack  */
#define I_PRECHARGE_TCOOLER_MASK                          (0x3F << 12) /* Pre-charge current settings bit-field for the "COOLER" battery temperature pack  */
#define I_PRECHARGE_TCOOLER_POS                           (12) /* Pre-charge current settings bit-field for the "COOLER" battery temperature pack  */
#define I_CHARGE_TWARMER_MASK                             (0x3F << 6) /* Charge current settings bit-field for the "WARMER" battery temperature pack zone */
#define I_CHARGE_TWARMER_POS                              (6) /* Charge current settings bit-field for the "WARMER" battery temperature pack zone */
#define I_CHARGE_TCOOLER_MASK                             (0x3F << 0) /* Charge current settings bit-field for the "COOLER" battery temperature pack zone */
#define I_CHARGE_TCOOLER_POS                              (0) /* Charge current settings bit-field for the "COOLER" battery temperature pack zone */

/* CHARGER_JEITA_CURRENT Register */

#define I_PRECHARGE_TWARM_MASK                            (0x3F << 18) /* Pre-Charge current setting for the Warm battery temperature zone. Regarding the  */
#define I_PRECHARGE_TWARM_POS                             (18) /* Pre-Charge current setting for the Warm battery temperature zone. Regarding the  */
#define I_PRECHARGE_TCOOL_MASK                            (0x3F << 12) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define I_PRECHARGE_TCOOL_POS                             (12) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define I_CHARGE_TWARM_MASK                               (0x3F << 6) /* Charge current setting for the Warm battery temperature pack zone. Regarding the */
#define I_CHARGE_TWARM_POS                                (6) /* Charge current setting for the Warm battery temperature pack zone. Regarding the */
#define I_CHARGE_TCOOL_MASK                               (0x3F << 0) /* Charge current setting for the "COOL" battery temperature level. Regarding the r */
#define I_CHARGE_TCOOL_POS                                (0) /* Charge current setting for the "COOL" battery temperature level. Regarding the r */

/* CHARGER_JEITA_V_CHARGE Register */

#define V_CHARGE_TWARMER_MASK                             (0x3F << 18) /* Charge voltage setting for the Warmer battery temperature zone. Regarding the ra */
#define V_CHARGE_TWARMER_POS                              (18) /* Charge voltage setting for the Warmer battery temperature zone. Regarding the ra */
#define V_CHARGE_TCOOLER_MASK                             (0x3F << 12) /* Charge voltage setting for the Cooler battery temperature zone. Regarding the ra */
#define V_CHARGE_TCOOLER_POS                              (12) /* Charge voltage setting for the Cooler battery temperature zone. Regarding the ra */
#define V_CHARGE_TWARM_MASK                               (0x3F << 6) /* Charge voltage setting for the Warm battery temperature zone. Regarding the rang */
#define V_CHARGE_TWARM_POS                                (6) /* Charge voltage setting for the Warm battery temperature zone. Regarding the rang */
#define V_CHARGE_TCOOL_MASK                               (0x3F << 0) /* Charge voltage setting for the Cool battery temperature zone. Regarding the rang */
#define V_CHARGE_TCOOL_POS                                (0) /* Charge voltage setting for the Cool battery temperature zone. Regarding the rang */

/* CHARGER_JEITA_V_OVP Register */

