AlmAck/svdtonuttx/demo/h/da1470_charger.h
#define V_OVP_TWARMER_MASK                                (0x3F << 18) /* VBAT Over-voltage Protection (OVP) setting for the Warmer battery temperature zo */
#define V_OVP_TWARMER_POS                                 (18) /* VBAT Over-voltage Protection (OVP) setting for the Warmer battery temperature zo */
#define V_OVP_TCOOLER_MASK                                (0x3F << 12) /* VBAT Over-voltage Protection (OVP) setting for the Cooler battery temperature zo */
#define V_OVP_TCOOLER_POS                                 (12) /* VBAT Over-voltage Protection (OVP) setting for the Cooler battery temperature zo */
#define V_OVP_TWARM_MASK                                  (0x3F << 6) /* VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone */
#define V_OVP_TWARM_POS                                   (6) /* VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone */
#define V_OVP_TCOOL_MASK                                  (0x3F << 0) /* VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone */
#define V_OVP_TCOOL_POS                                   (0) /* VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone */

/* CHARGER_JEITA_V_PRECHARGE Register */

#define V_PRECHARGE_TWARMER_MASK                          (0x3F << 18) /* Pre-Charge voltage setting for the Warmer battery temperature zone. Regarding th */
#define V_PRECHARGE_TWARMER_POS                           (18) /* Pre-Charge voltage setting for the Warmer battery temperature zone. Regarding th */
#define V_PRECHARGE_TCOOLER_MASK                          (0x3F << 12) /* Pre-Charge voltage setting for the Cooler battery temperature zone. Regarding th */
#define V_PRECHARGE_TCOOLER_POS                           (12) /* Pre-Charge voltage setting for the Cooler battery temperature zone. Regarding th */
#define V_PRECHARGE_TWARM_MASK                            (0x3F << 6) /* Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the  */
#define V_PRECHARGE_TWARM_POS                             (6) /* Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the  */
#define V_PRECHARGE_TCOOL_MASK                            (0x3F << 0) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */
#define V_PRECHARGE_TCOOL_POS                             (0) /* Pre-Charge current setting for the Cool battery temperature zone. Regarding the  */

/* CHARGER_JEITA_V_REPLENISH Register */

#define V_REPLENISH_TWARMER_MASK                          (0x3F << 18) /* Replenish voltage setting for the Warmer battery temperature zone. Regarding the */
#define V_REPLENISH_TWARMER_POS                           (18) /* Replenish voltage setting for the Warmer battery temperature zone. Regarding the */
#define V_REPLENISH_TCOOLER_MASK                          (0x3F << 12) /* Replenish voltage setting for the Cooler battery temperature zone. Regarding the */
#define V_REPLENISH_TCOOLER_POS                           (12) /* Replenish voltage setting for the Cooler battery temperature zone. Regarding the */
#define V_REPLENISH_TWARM_MASK                            (0x3F << 6) /* Replenish voltage setting for the Warm battery temperature zone. Regarding the r */
#define V_REPLENISH_TWARM_POS                             (6) /* Replenish voltage setting for the Warm battery temperature zone. Regarding the r */
#define V_REPLENISH_TCOOL_MASK                            (0x3F << 0) /* Replenish voltage setting for the Cool battery temperature zone. Regarding the r */
#define V_REPLENISH_TCOOL_POS                             (0) /* Replenish voltage setting for the Cool battery temperature zone. Regarding the r */

/* CHARGER_LOCK Register */

#define CHARGER_SWLOCK_EN                                 (1U << 15) /* 0 = SW-based protection of Charger registers is disabled, protection is dependen */
#define JEITA_I_CHARGE2_LOCK                              (1U << 14) /* 0 = CHARGER_JEITA_CURRENT2_REG is un-locked, register writes are allowed 1 = CHA */
#define JEITA_I_CHARGE_LOCK                               (1U << 13) /* 0 = CHARGER_JEITA_CURRENT_REG is un-locked, register writes are allowed 1 = CHAR */
#define JEITA_V_OVP_LOCK                                  (1U << 12) /* 0 = CHARGER_JEITA_V_OVP_REG is un-locked, register writes are allowed 1 = CHARGE */
#define JEITA_V_PRECHARGE_LOCK                            (1U << 11) /* 0 = CHARGER_JEITA_V_PRECHARGE_REG is un-locked, register writes are allowed 1 =  */
#define JEITA_V_CHARGE_LOCK                               (1U << 10) /* 0 = CHARGER_JEITA_V_CHARGE_REG is un-locked, register writes are allowed 1 = CHA */
#define TOTAL_CHARGE_TIMEOUT_LOCK                         (1U << 9) /* 0 = CHARGER_TOTAL_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = */
#define CV_CHARGE_TIMEOUT_LOCK                            (1U << 8) /* 0 = CHARGER_CV_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = CH */
#define CC_CHARGE_TIMEOUT_LOCK                            (1U << 7) /* 0 = CHARGER_CC_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = CH */
#define PRECHARGE_TIMEOUT_LOCK                            (1U << 6) /* 0 = CHARGER_PRE_CHARGE_TIMER_REG is un-locked, register writes are allowed 1 = C */
#define TEMPSET2_PARAM_LOCK                               (1U << 5) /* 0 = CHARGER_TEMPSET2_PARAM_REG is un-locked, register writes are allowed 1 = CHA */
#define TEMPSET_PARAM_LOCK                                (1U << 4) /* 0 = CHARGER_TEMPSET_PARAM_REG is un-locked, register writes are allowed 1 = CHAR */
#define CURRENT_PARAM_LOCK                                (1U << 3) /* 0 = CHARGER_CURRENT_PARAM_REG is un-locked, writes are allowed 1 = All bit-field */
#define VOLTAGE_PARAM_LOCK                                (1U << 2) /* 0 = CHARGER_VOLTAGE_PARAM_REG is un-locked, register writes are allowed 1 = All  */
#define CHARGER_TEST_CTRL_LOCK                            (1U << 1) /* 0 = CHARGER_TEST_CTRL_REG is un-locked, register writes are allowed 1 = CHARGER_ */
#define CHARGER_CTRL_LOCK                                 (1U << 0) /* 0 = Protected bit-fields of CHARGER_CTRL_REG are un-locked, register writes are  */

/* CHARGER_PRE_CHARGE_TIMER Register */

#define PRE_CHARGE_TIMER_MASK                             (0x7FFF << 16) /* Returns the current value of the Pre-Charge timeout counter, running at a 1Hz cl */
#define PRE_CHARGE_TIMER_POS                              (16) /* Returns the current value of the Pre-Charge timeout counter, running at a 1Hz cl */
#define MAX_PRE_CHARGE_TIME_MASK                          (0x7FFF << 0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */
#define MAX_PRE_CHARGE_TIME_POS                           (0) /* This bit-field determines the maximum time (measured in ticks of the Charger's 1 */

/* CHARGER_PWR_UP_TIMER Register */

#define CHARGER_PWR_UP_TIMER_MASK                         (0x1F << 16) /* Returns the current value of the charger's power-up timer, running with the 1Khz */
#define CHARGER_PWR_UP_TIMER_POS                          (16) /* Returns the current value of the charger's power-up timer, running with the 1Khz */
#define CHARGER_PWR_UP_SETTLING_MASK                      (0x1F << 0) /* This bit-field determines the charger's power-up (settling) time, required for t */
#define CHARGER_PWR_UP_SETTLING_POS                       (0) /* This bit-field determines the charger's power-up (settling) time, required for t */

/* CHARGER_STATE_IRQ_CLR Register */

#define CV_TO_PRECHARGE_IRQ_CLR                           (1U << 11) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CC_TO_PRECHARGE_IRQ_CLR                           (1U << 10) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CV_TO_CC_IRQ_CLR                                  (1U << 9) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define TBAT_STATUS_UPDATE_IRQ_CLR                        (1U << 8) /* Writing a 1 will reset the Battery temperature status update IRQ status bit ; wr */
#define TBAT_PROT_TO_PRECHARGE_IRQ_CLR                    (1U << 7) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define TDIE_PROT_TO_PRECHARGE_IRQ_CLR                    (1U << 6) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define EOC_TO_PRECHARGE_IRQ_CLR                          (1U << 5) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CV_TO_EOC_IRQ_CLR                                 (1U << 4) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CC_TO_EOC_IRQ_CLR                                 (1U << 3) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define CC_TO_CV_IRQ_CLR                                  (1U << 2) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define PRECHARGE_TO_CC_IRQ_CLR                           (1U << 1) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */
#define DISABLED_TO_PRECHARGE_IRQ_CLR                     (1U << 0) /* Writing a 1 will reset the respective Charger's State IRQ status bit ; writing a */

/* CHARGER_STATE_IRQ_MASK Register */

