AlmAck/svdtonuttx/demo/h/da1470_charger.h
#define TBAT_MON_TIMER_MASK                               (0x3FF << 16) /* This is the battery temperature monitoring timer, counting with the Charger's 1K */
#define TBAT_MON_TIMER_POS                                (16) /* This is the battery temperature monitoring timer, counting with the Charger's 1K */
#define TBAT_MON_INTERVAL_MASK                            (0x3FF << 0) /* Timing interval (in ms) for the Battery temperature monitoring. This interval de */
#define TBAT_MON_INTERVAL_POS                             (0) /* Timing interval (in ms) for the Battery temperature monitoring. This interval de */

/* CHARGER_TDIE_COMP_TIMER Register */

#define TDIE_COMP_TIMER_MASK                              (0x3FF << 16) /* Returns the current value of the timer used to determine when the Die temperatur */
#define TDIE_COMP_TIMER_POS                               (16) /* Returns the current value of the timer used to determine when the Die temperatur */
#define TDIE_COMP_SETTLING_MASK                           (0x3FF << 0) /* Settling time threshold (in us) for the Die temperature comparator. */
#define TDIE_COMP_SETTLING_POS                            (0) /* Settling time threshold (in us) for the Die temperature comparator. */

/* CHARGER_TEMPSET2_PARAM Register */

#define TBAT_WARMER_MASK                                  (0x3F << 18) /* This bit-field determines the battery temperature threshold above which the "WAR */
#define TBAT_WARMER_POS                                   (18) /* This bit-field determines the battery temperature threshold above which the "WAR */
#define TBAT_WARM_MASK                                    (0x3F << 12) /* This bit-field determines the battery temperature above which the charge current */
#define TBAT_WARM_POS                                     (12) /* This bit-field determines the battery temperature above which the charge current */
#define TBAT_COOL_MASK                                    (0x3F << 6) /* This bit-field determines the battery temperature below which the charge current */
#define TBAT_COOL_POS                                     (6) /* This bit-field determines the battery temperature below which the charge current */
#define TBAT_COOLER_MASK                                  (0x3F << 0) /* This bit-field determines the battery temperature below which the charge current */
#define TBAT_COOLER_POS                                   (0) /* This bit-field determines the battery temperature below which the charge current */

/* CHARGER_TEMPSET_PARAM Register */

#define TDIE_MAX_MASK                                     (0x7 << 12) /* This bit-field determines the maximum Die temperature level limit, ranging from  */
#define TDIE_MAX_POS                                      (12) /* This bit-field determines the maximum Die temperature level limit, ranging from  */
#define TBAT_HOT_MASK                                     (0x3F << 6) /* This bit-field determines the battery temperature above which the charge current */
#define TBAT_HOT_POS                                      (6) /* This bit-field determines the battery temperature above which the charge current */
#define TBAT_COLD_MASK                                    (0x3F << 0) /* This bit-field determines the battery temperature below which the charge current */
#define TBAT_COLD_POS                                     (0) /* This bit-field determines the battery temperature below which the charge current */

/* CHARGER_THOT_COMP_TIMER Register */

#define THOT_COMP_TIMER_MASK                              (0x3FF << 16) /* Returns the battery temperature comparator's timer dedicated for the "Hot" level */
#define THOT_COMP_TIMER_POS                               (16) /* Returns the battery temperature comparator's timer dedicated for the "Hot" level */
#define THOT_COMP_SETTLING_MASK                           (0x3FF << 0) /* Charger's battery temperature comparator settling time (specified in us), specif */
#define THOT_COMP_SETTLING_POS                            (0) /* Charger's battery temperature comparator settling time (specified in us), specif */

/* CHARGER_TOTAL_CHARGE_TIMER Register */

#define TOTAL_CHARGE_TIMER_MASK                           (0xFFFF << 16) /* Returns the current value of the overall charge timeout counter, running at a 1H */
#define TOTAL_CHARGE_TIMER_POS                            (16) /* Returns the current value of the overall charge timeout counter, running at a 1H */
#define MAX_TOTAL_CHARGE_TIME_MASK                        (0xFFFF << 0) /* This bit-field determines the maximum overall charging time allowed (measured in */
#define MAX_TOTAL_CHARGE_TIME_POS                         (0) /* This bit-field determines the maximum overall charging time allowed (measured in */

/* CHARGER_VBAT_COMP_TIMER Register */

#define VBAT_COMP_TIMER_MASK                              (0x3FF << 16) /* Returns the current value of the timer used to determine when the output of the  */
#define VBAT_COMP_TIMER_POS                               (16) /* Returns the current value of the timer used to determine when the output of the  */
#define VBAT_COMP_SETTLING_MASK                           (0x3FF << 0) /* Settling time threshold (in us) for the Vbat comparator checking Vbat vs the pro */
#define VBAT_COMP_SETTLING_POS                            (0) /* Settling time threshold (in us) for the Vbat comparator checking Vbat vs the pro */

/* CHARGER_VOLTAGE_PARAM Register */

#define V_OVP_MASK                                        (0x3F << 18) /* This bit-field determines the VBAT Over-voltage protection limit. This Over-volt */
#define V_OVP_POS                                         (18) /* This bit-field determines the VBAT Over-voltage protection limit. This Over-volt */
#define V_REPLENISH_MASK                                  (0x3F << 12) /* This bit-field determines the absolute value (in V) of the Replenish voltage thr */
#define V_REPLENISH_POS                                   (12) /* This bit-field determines the absolute value (in V) of the Replenish voltage thr */
#define V_PRECHARGE_MASK                                  (0x3F << 6) /* This bit-field determines the voltage level at which the battery is considered a */
#define V_PRECHARGE_POS                                   (6) /* This bit-field determines the voltage level at which the battery is considered a */
#define V_CHARGE_MASK                                     (0x3F << 0) /* This bit-field determines the charge voltage levels supported. The supported lev */
#define V_CHARGE_POS                                      (0) /* This bit-field determines the charge voltage levels supported. The supported lev */

